name: "fold_template"
layer {
  name: "data"
  type: "HDF5Data"
  top: "data"
  top: "label"
  hdf5_data_param {
    source: <train_source>
    batch_size: 100
  }
  include: {
    phase: TRAIN
  }
}
layer {
  name: "data"
  type: "HDF5Data"
  top: "data"
  top: "label"
  hdf5_data_param {
    source: <valid_source>
    batch_size: 100
  }
  include: {
    phase: TEST
  }
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "data"
  top: "ip1"
  inner_product_param {
    num_output: num_node
    weight_filler {
      type: "uniform"
      min: -1
      max: 1
    }
    bias_term: false
  }
}
layer {
  name: "sigmoid1"
  type: "Sigmoid"
  bottom: "ip1"
  top: "sigmoid1"
}
layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "sigmoid1"
  top: "ip2"
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "uniform"
      min: -1
      max: 1
    }
    bias_term: false
  }
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}
